; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v1 - type_1 ?v3 - type_2)
 	      (pred_3 ?v5 - object ?v3 - type_2)
	      (pred_1 ?v1 - type_1 ?v4 - type_3)
	      (pred_2 ?v1 - type_1 ?v5 - object ?v4 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v6 ?v7 - type_2)
       :precondition (and  (pred_4 ?v1 ?v6))
       :effect (and  (pred_4 ?v1 ?v7)
		     (not (pred_4 ?v1 ?v6))))

   (:action op_1
       :parameters (?v1 - type_1 ?v2 - object ?v8 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v8) (pred_4 ?v1 ?v8) (pred_1 ?v1 ?v4))
       :effect (and (pred_2 ?v1 ?v2 ?v4)
		    (not (pred_3 ?v2 ?v8)) 
		    (not (pred_1 ?v1 ?v4))))

   (:action op_2
       :parameters (?v1 - type_1 ?v2 - object ?v8 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v2 ?v4) (pred_4 ?v1 ?v8))
       :effect (and (pred_3 ?v2 ?v8)
		    (pred_1 ?v1 ?v4)
		    (not (pred_2 ?v1 ?v2 ?v4)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_02 obj_10 - type_1
obj_08 obj_03 obj_05 obj_12 - type_3
obj_01 obj_11 obj_07 - type_2
obj_04 obj_09 obj_06 - object)
(:init
(pred_4 obj_02 obj_11)
(pred_1 obj_02 obj_08)
(pred_1 obj_02 obj_03)
(pred_4 obj_10 obj_07)
(pred_1 obj_10 obj_05)
(pred_1 obj_10 obj_12)
(pred_3 obj_04 obj_11)
(pred_3 obj_09 obj_11)
(pred_3 obj_06 obj_01)
)
(:goal
(and
(pred_3 obj_04 obj_11)
(pred_3 obj_09 obj_07)
(pred_3 obj_06 obj_07)
)
)

(:constraints
  (always (not (pred_4 obj_02 obj_07)))
)
)

; plan
1. (op_1 obj_02 obj_09 obj_11 obj_03)
   deleted: (pred_3 obj_09 obj_11) (pred_1 obj_02 obj_03)
   added: (pred_2 obj_02 obj_09 obj_03)
   goals met: 1 of 3
2. (op_3 obj_10 obj_07 obj_01)
   deleted: (pred_4 obj_10 obj_07)
   added: (pred_4 obj_10 obj_01)
   goals met: 1 of 3
3. (op_3 obj_02 obj_11 obj_01)
   deleted: (pred_4 obj_02 obj_11)
   added: (pred_4 obj_02 obj_01)
   goals met: 1 of 3
4. (op_1 obj_02 obj_06 obj_01 obj_08)
   deleted: (pred_3 obj_06 obj_01) (pred_1 obj_02 obj_08)
   added: (pred_2 obj_02 obj_06 obj_08)
   goals met: 1 of 3
5. (op_2 obj_02 obj_09 obj_01 obj_03)
   deleted: (pred_2 obj_02 obj_09 obj_03)
   added: (pred_3 obj_09 obj_01) (pred_1 obj_02 obj_03)
   goals met: 1 of 3
6. (op_1 obj_10 obj_09 obj_01 obj_12)
   deleted: (pred_3 obj_09 obj_01) (pred_1 obj_10 obj_12)
   added: (pred_2 obj_10 obj_09 obj_12)
   goals met: 1 of 3
7. (op_2 obj_02 obj_06 obj_01 obj_08)
   deleted: (pred_2 obj_02 obj_06 obj_08)
   added: (pred_3 obj_06 obj_01) (pred_1 obj_02 obj_08)
   goals met: 1 of 3
8. (op_3 obj_10 obj_01 obj_07)
   deleted: (pred_4 obj_10 obj_01)
   added: (pred_4 obj_10 obj_07)
   goals met: 1 of 3
9. (op_2 obj_10 obj_09 obj_07 obj_12)
   deleted: (pred_2 obj_10 obj_09 obj_12)
   added: (pred_3 obj_09 obj_07) (pred_1 obj_10 obj_12)
   goals met: 2 of 3
10. (op_3 obj_10 obj_07 obj_01)
   deleted: (pred_4 obj_10 obj_07)
   added: (pred_4 obj_10 obj_01)
   goals met: 2 of 3
11. (op_1 obj_10 obj_06 obj_01 obj_12)
   deleted: (pred_3 obj_06 obj_01) (pred_1 obj_10 obj_12)
   added: (pred_2 obj_10 obj_06 obj_12)
   goals met: 2 of 3
12. (op_3 obj_10 obj_01 obj_07)
   deleted: (pred_4 obj_10 obj_01)
   added: (pred_4 obj_10 obj_07)
   goals met: 2 of 3
13. (op_2 obj_10 obj_06 obj_07 obj_12)
   deleted: (pred_2 obj_10 obj_06 obj_12)
   added: (pred_3 obj_06 obj_07) (pred_1 obj_10 obj_12)
   goals met: 3 of 3
